In [46]:
#Name:vaishali balaji Akade
#Div:A
#Rollno:01
#collage:Keystone school of engineering

In [47]:
import pandas as pd

In [48]:
df=pd.read_csv('student.csv')

In [49]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [50]:
#slicing in pandas

In [51]:
#we can use iloc to slice a list based on its indices
#.iloc[row_slice,column_slice]

In [52]:
x=df.iloc[3:4,1:6]
x

      name class  marks  age
3  ajinkya    TE  69.66   20

In [53]:
#we can also use iloc to get specific rows from dataset.

In [54]:
y=df.iloc[[2,3,4,1],[1,2]]

In [55]:
y

      name class
2   aniket    BE
3  ajinkya    TE
4     asha    TE
1     amit    TE

In [56]:
#Another way to slicing a dataset using loc.this uses labels and not indices to slice.

In [57]:
df.loc[:,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [58]:
df.loc[:,['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [59]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [60]:
df.name

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [61]:
df.iloc[list(range(5))+list(range(6,10))]

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [62]:
#.drop()method can be used to drop a row or column from our dataset.it takes axis as an argument.

In [63]:
df.drop(5)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [64]:
df.drop(['name','class'], axis=1)

   roll  marks  age
0     1  56.77   22
1     2  59.77   21
2     3  76.88   19
3     4  69.66   20
4     5  63.28   20
5     6  49.55   20
6     7  65.34   19
7     8  68.33   23
8     9  56.75   20
9    10  78.66   21

In [65]:
#functions

In [66]:
df.marks.mean()

64.499

In [67]:
df.marks.max()

78.66

In [68]:
df.marks.min()

49.55

In [69]:
df.marks.sum()

644.9899999999999

In [70]:
df.name.sum()

'anilamitaniketajinkyaashaayeshaamaramitaamolanmol'

In [71]:
df.name.min()

'ajinkya'

In [72]:
df.name.max()

'ayesha'

In [73]:
df.marks.median()

64.31

In [74]:
df.marks.std()

9.207178901994535

In [75]:
df['class'].value_counts()

class
TE    5
BE    5
Name: count, dtype: int64

In [76]:
df['age'].value_counts()

age
20    4
21    2
19    2
22    1
23    1
Name: count, dtype: int64

In [77]:
df['class'].mode()

0    BE
1    TE
Name: class, dtype: object

In [78]:
df['age'].mode()

0    20
Name: age, dtype: int64

In [79]:
df['marks'].mode()

0    49.55
1    56.75
2    56.77
3    59.77
4    63.28
5    65.34
6    68.33
7    69.66
8    76.88
9    78.66
Name: marks, dtype: float64

In [80]:
df['name'].count()

10

In [81]:
df.isna().sum()

roll     0
name     0
class    0
marks    0
age      0
dtype: int64

In [82]:
df.min()

roll           1
name     ajinkya
class         BE
marks      49.55
age           19
dtype: object

In [83]:
df.mean(numeric_only=True)

roll      5.500
marks    64.499
age      20.500
dtype: float64

In [84]:
df.mean(numeric_only=True, axis = 1)

0    26.590000
1    27.590000
2    32.960000
3    31.220000
4    29.426667
5    25.183333
6    30.446667
7    33.110000
8    28.583333
9    36.553333
dtype: float64

In [85]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [86]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000